//Wed Feb 11 2026 07:53:29 GMT+0000 (Coordinated Universal Time)
//Base:<url id="cv1cref6o68qmpt26ol0" type="url" status="parsed" title="GitHub - echo094/decode-js: JS混淆代码的AST分析工具 AST analysis tool for obfuscated JS code" wc="2165">https://github.com/echo094/decode-js</url>
//Modify:<url id="cv1cref6o68qmpt26olg" type="url" status="parsed" title="GitHub - smallfawn/decode_action: 世界上本来不存在加密，加密的人多了，也便成就了解密" wc="741">https://github.com/smallfawn/decode_action</url>
(function () {})();
document.addEventListener("DOMContentLoaded", function () {
  var _0x17d970 = (navigator.language || navigator.browserLanguage).toLowerCase();
  if (_0x17d970.startsWith("zh-tw") || _0x17d970.startsWith("zh-hant")) {
    fetch(window.location.href).then(_0x8617d6 => {
      _0x8617d6.headers.get("X-Country") === "TW" && _0x5cbe66();
    });
  } else _0x13c022();
});
function _0x5cbe66() {
  const _0x821b5b = document.querySelectorAll(".article-content p"),
    _0x4d3569 = new RegExp("([武].*[漢汉].*[肺].*[炎].*[源].*[自].*[中㆗].*[國国])|([武].*[漢汉].*[病疒寎].*[毒].*[研].*[究].*[所].*[蝙].*[蝠].*[女])|([光].*[復复].*[香].*[港].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[時时溡].*[代].*[革].*[命掵])|([罷罢].*[工].*[罷罢].*[課课].*[罷罢].*[市].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[罷罢].*[免凂].*[獨独].*[裁].*[國国].*[賊贼])|([翻飜].*[牆墙].*[還还].*[愛爱嬡嫒].*[黨党].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[纯純蒓莼蓴].*[屬属].*[狗豞].*[糧粮].*[養养])|([八仈捌⑧⓼❽㊇㈧].*[九勼玖⑨⓽❾㊈㈨].*[六陸陆⑥⓺❻㊅㈥].*[四④⓸❹㊃肆㈣㆕].*[天兲㆝].*[安].*[門门].*[大].*[屠廜].*[殺杀摋𢫬])|([七⑦⓻❼㊆柒㈦].*[九勼玖⑨⓽❾㊈㈨].*[八仈捌⑧⓼❽㊇㈧].*[河].*[南遖].*[板].*[橋桥].*[水].*[庫库厙厍].*[潰溃].*[壩坝].*[事].*[件])|([今].*[日ㄖ㈰㊐].*[舔婖].*[趙赵].*[一①⓵❶㊀壹㈠].*[時时溡].*[爽奭摤HＨGＧ黃黄同𝐇𝐡𝐻𝑯𝒉𝓗𝕙𝖧𝗁𝗛𝗵𝘏𝘩𝙃𝙝𝙷𝚑𝚮𝔾𝕘𝐆𝐠𝐺𝑔𝑮𝒈].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[明].*[日ㄖ㈰㊐].*[全].*[家傢].*[火].*[葬].*[場场])|([洪].*[湖].*[水].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[浪].*[打咑].*[浪].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[粉帉].*[紅红葒蛆].*[死屍].*[爹爸父].*[又還还].*[死屍].*[娘妈媽母])|([三㆔弎叁叄③⑶⒊㊂𝟯𝟑𝟛𝟹].*[民姄].*[主].*[義义].*[統统].*[一①⓵❶㊀壹㈠].*[中㆗].*[國国])|([光].*[復复].*[民姄].*[國国].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[再].*[造].*[共珙垬].*[和])|([驅驱].*[除].*[共珙垬].*[匪].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[恢].*[復复].*[中㆗].*[華华])|([中㆗].*[華华].*[民姄].*[國国].*[光].*[復复].*[大].*[陸陆].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[建].*[設设].*[自].*[由].*[民姄].*[主].*[新].*[中㆗].*[國国])|([別莂].*[看].*[今].*[天兲㆝].*[鬧闹].*[得].*[歡欢].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[小].*[心].*[今].*[後后].*[拉].*[清].*[單单])|([打咑].*[江茳].*[山屾].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[坐].*[江茳].*[山屾].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[人㆟亾].*[民姄].*[就].*[是].*[江茳].*[山屾])|([小].*[學学㈻].*[博].*[士仕].*[談谈].*[治].*[國国].*[理].*[政])|([炮].*[轟轰].*[中㆗].*[南遖].*[海嗨].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[活萿].*[捉浞].*[習习刁].*[龘大].*[龘大])|([放].*[下].*[助].*[人㆟亾].*[情].*[節节兯].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[尊澊].*[重偅].*[粉帉].*[紅红葒蛆].*[命掵].*[運运])|([基gGＧｇ𝔾𝕘𝐆𝐠𝐺𝑔𝑮𝒈].*[佬].*[挺侹].*[共珙垬].*[當当].*[舔婖].*[狗豞].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[腦脑].*[裡里裏].*[全].*[是].*[屎迉].*[和].*[垢詬])|([撒潵].*[潑泼].*[打咑].*[滾滚].*[像].*[條条].*[狗豞].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[戰战].*[狼].*[粉帉].*[紅红葒蛆].*[滿满].*[地㆞哋].*[走跑趉])|([毛耄髦牦芼猫毝].*[病疒寎].*[不芣].*[改妀].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[積积].*[惡恶悪].*[成荿].*[習习刁])|([維维惟].*[尼妮].*[兩两両倆2②⑵⒉⓶㆓㊁𝟮𝟐𝟸𝟚🯲].*[百佰咟].*[斤釿].*[麥麦].*[子ふ].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[十拾⑩⑽⒑⓾╋╬❿➉➓].*[里哩俚].*[山屾].*[路蕗].*[不芣].*[換换].*[肩])|([元沅].*[首渞].*[細细].*[頸莖颈茎].*[瓶甁].*[，,᛫‣⬄⯰⯘⮕⮚⮞⮩⮫⯮].*[粉帉].*[红红葒蛆].*[玻箥].*[璃].*[心])", "gu");
  _0x821b5b.forEach((_0x418604, _0x130c33) => {
    let _0x30ab2f = _0x418604.textContent;
    if (_0x4d3569.test(_0x30ab2f)) {
      let _0x297fae = _0x30ab2f.replace(_0x4d3569, "");
      _0x418604.textContent = _0x297fae;
    }
  });
}
function _0x13c022() {
  const _0x46abb9 = document.getElementById("watermark-canvas"),
    _0x4a8a85 = _0x46abb9.getContext("2d"),
    _0x524335 = ["六四天安门大屠杀", "中华民国在台湾", "光复香港，时代革命", "武汉肺炎源自中国", "新疆集中营", "西藏种族灭绝", "Taiwanese", "驱除共匪恢复中华", "台湾人不是中国人", "九评共产党", "于朦胧虐杀冤案", "共匪活摘器官产业"],
    _0x23ce30 = 22,
    _0x408234 = "rgba(0, 0, 0, 0.2)",
    _0x1d1403 = -15 * Math.PI / 180,
    _0x2ccf89 = 300,
    _0x42bb61 = 640,
    _0x28f131 = 50,
    _0x208320 = 60,
    _0x21a33b = document.createElement("canvas"),
    _0x92ed89 = _0x21a33b.getContext("2d");
  _0x21a33b.width = _0x2ccf89;
  _0x21a33b.height = _0x42bb61;
  _0x92ed89.font = _0x23ce30 + "px sans-serif";
  _0x92ed89.fillStyle = _0x408234;
  _0x92ed89.textBaseline = "middle";
  let _0x168826 = (_0x42bb61 - (_0x524335.length - 1) * _0x28f131) / 2;
  for (let _0x19619e = 0; _0x19619e < _0x524335.length; _0x19619e++) {
    const _0xae59ef = _0x524335[_0x19619e],
      _0x1c04a0 = _0x19619e % 2 === 0 ? _0x2ccf89 / 2 - _0x208320 / 2 : _0x2ccf89 / 2 + _0x208320 / 2;
    _0x92ed89.textAlign = "center";
    _0x92ed89.save();
    _0x92ed89.translate(_0x1c04a0, _0x168826);
    _0x92ed89.rotate(_0x1d1403);
    _0x92ed89.fillText(_0xae59ef, 0, 0);
    _0x92ed89.restore();
    _0x168826 += _0x28f131;
  }
  const _0x308e4d = _0x4a8a85.createPattern(_0x21a33b, "repeat");
  function _0x11f24a() {
    {
      const _0x57f92d = document.querySelector("article");
      if (!_0x57f92d) return;
      const _0x1a90a3 = _0x57f92d.getBoundingClientRect(),
        _0x4bd2e1 = 30000;
      _0x46abb9.width = _0x1a90a3.width;
      _0x46abb9.height = Math.min(_0x1a90a3.height, _0x4bd2e1);
      _0x46abb9.style.width = _0x46abb9.width + "px";
      _0x46abb9.style.height = _0x46abb9.height + "px";
      if (_0x46abb9.width <= 0 || _0x46abb9.height <= 0) {
        return;
      }
      _0x4a8a85.fillStyle = _0x308e4d;
      _0x4a8a85.fillRect(0, 0, _0x46abb9.width, _0x46abb9.height);
    }
  }
  _0x11f24a();
  window.addEventListener("resize", _0x11f24a);
}